----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [16, 16, 416, 416]             432
       BatchNorm2d-2         [16, 16, 416, 416]              32
         LeakyReLU-3         [16, 16, 416, 416]               0
          CNNBlock-4         [16, 16, 416, 416]               0
            Conv2d-5          [16, 8, 416, 416]             128
       BatchNorm2d-6          [16, 8, 416, 416]              16
         LeakyReLU-7          [16, 8, 416, 416]               0
          CNNBlock-8          [16, 8, 416, 416]               0
            Conv2d-9         [16, 16, 416, 416]           1,152
      BatchNorm2d-10         [16, 16, 416, 416]              32
        LeakyReLU-11         [16, 16, 416, 416]               0
         CNNBlock-12         [16, 16, 416, 416]               0
    ResidualBlock-13         [16, 16, 416, 416]               0
           Conv2d-14         [16, 32, 208, 208]           4,608
      BatchNorm2d-15         [16, 32, 208, 208]              64
        LeakyReLU-16         [16, 32, 208, 208]               0
         CNNBlock-17         [16, 32, 208, 208]               0
           Conv2d-18         [16, 16, 208, 208]             512
      BatchNorm2d-19         [16, 16, 208, 208]              32
        LeakyReLU-20         [16, 16, 208, 208]               0
         CNNBlock-21         [16, 16, 208, 208]               0
           Conv2d-22         [16, 32, 208, 208]           4,608
      BatchNorm2d-23         [16, 32, 208, 208]              64
        LeakyReLU-24         [16, 32, 208, 208]               0
         CNNBlock-25         [16, 32, 208, 208]               0
    ResidualBlock-26         [16, 32, 208, 208]               0
           Conv2d-27         [16, 64, 104, 104]          18,432
      BatchNorm2d-28         [16, 64, 104, 104]             128
        LeakyReLU-29         [16, 64, 104, 104]               0
         CNNBlock-30         [16, 64, 104, 104]               0
           Conv2d-31         [16, 32, 104, 104]           2,048
      BatchNorm2d-32         [16, 32, 104, 104]              64
        LeakyReLU-33         [16, 32, 104, 104]               0
         CNNBlock-34         [16, 32, 104, 104]               0
           Conv2d-35         [16, 64, 104, 104]          18,432
      BatchNorm2d-36         [16, 64, 104, 104]             128
        LeakyReLU-37         [16, 64, 104, 104]               0
         CNNBlock-38         [16, 64, 104, 104]               0
    ResidualBlock-39         [16, 64, 104, 104]               0
           Conv2d-40          [16, 128, 52, 52]          73,728
      BatchNorm2d-41          [16, 128, 52, 52]             256
        LeakyReLU-42          [16, 128, 52, 52]               0
         CNNBlock-43          [16, 128, 52, 52]               0
           Conv2d-44           [16, 64, 52, 52]           8,192
      BatchNorm2d-45           [16, 64, 52, 52]             128
        LeakyReLU-46           [16, 64, 52, 52]               0
         CNNBlock-47           [16, 64, 52, 52]               0
           Conv2d-48          [16, 128, 52, 52]          73,728
      BatchNorm2d-49          [16, 128, 52, 52]             256
        LeakyReLU-50          [16, 128, 52, 52]               0
         CNNBlock-51          [16, 128, 52, 52]               0
           Conv2d-52           [16, 64, 52, 52]           8,192
      BatchNorm2d-53           [16, 64, 52, 52]             128
        LeakyReLU-54           [16, 64, 52, 52]               0
         CNNBlock-55           [16, 64, 52, 52]               0
           Conv2d-56          [16, 128, 52, 52]          73,728
      BatchNorm2d-57          [16, 128, 52, 52]             256
        LeakyReLU-58          [16, 128, 52, 52]               0
         CNNBlock-59          [16, 128, 52, 52]               0
    ResidualBlock-60          [16, 128, 52, 52]               0
           Conv2d-61          [16, 256, 26, 26]         294,912
      BatchNorm2d-62          [16, 256, 26, 26]             512
        LeakyReLU-63          [16, 256, 26, 26]               0
         CNNBlock-64          [16, 256, 26, 26]               0
           Conv2d-65          [16, 128, 26, 26]          32,768
      BatchNorm2d-66          [16, 128, 26, 26]             256
        LeakyReLU-67          [16, 128, 26, 26]               0
         CNNBlock-68          [16, 128, 26, 26]               0
           Conv2d-69          [16, 256, 26, 26]         294,912
      BatchNorm2d-70          [16, 256, 26, 26]             512
        LeakyReLU-71          [16, 256, 26, 26]               0
         CNNBlock-72          [16, 256, 26, 26]               0
           Conv2d-73          [16, 128, 26, 26]          32,768
      BatchNorm2d-74          [16, 128, 26, 26]             256
        LeakyReLU-75          [16, 128, 26, 26]               0
         CNNBlock-76          [16, 128, 26, 26]               0
           Conv2d-77          [16, 256, 26, 26]         294,912
      BatchNorm2d-78          [16, 256, 26, 26]             512
        LeakyReLU-79          [16, 256, 26, 26]               0
         CNNBlock-80          [16, 256, 26, 26]               0
    ResidualBlock-81          [16, 256, 26, 26]               0
           Conv2d-82          [16, 512, 13, 13]       1,179,648
      BatchNorm2d-83          [16, 512, 13, 13]           1,024
        LeakyReLU-84          [16, 512, 13, 13]               0
         CNNBlock-85          [16, 512, 13, 13]               0
           Conv2d-86          [16, 256, 13, 13]         131,072
      BatchNorm2d-87          [16, 256, 13, 13]             512
        LeakyReLU-88          [16, 256, 13, 13]               0
         CNNBlock-89          [16, 256, 13, 13]               0
           Conv2d-90          [16, 512, 13, 13]       1,179,648
      BatchNorm2d-91          [16, 512, 13, 13]           1,024
        LeakyReLU-92          [16, 512, 13, 13]               0
         CNNBlock-93          [16, 512, 13, 13]               0
    ResidualBlock-94          [16, 512, 13, 13]               0
           Conv2d-95          [16, 256, 13, 13]         131,072
      BatchNorm2d-96          [16, 256, 13, 13]             512
        LeakyReLU-97          [16, 256, 13, 13]               0
         CNNBlock-98          [16, 256, 13, 13]               0
           Conv2d-99          [16, 512, 13, 13]       1,179,648
     BatchNorm2d-100          [16, 512, 13, 13]           1,024
       LeakyReLU-101          [16, 512, 13, 13]               0
        CNNBlock-102          [16, 512, 13, 13]               0
          Conv2d-103          [16, 256, 13, 13]         131,072
     BatchNorm2d-104          [16, 256, 13, 13]             512
       LeakyReLU-105          [16, 256, 13, 13]               0
        CNNBlock-106          [16, 256, 13, 13]               0
          Conv2d-107          [16, 512, 13, 13]       1,179,648
     BatchNorm2d-108          [16, 512, 13, 13]           1,024
       LeakyReLU-109          [16, 512, 13, 13]               0
        CNNBlock-110          [16, 512, 13, 13]               0
   ResidualBlock-111          [16, 512, 13, 13]               0
          Conv2d-112          [16, 256, 13, 13]         131,072
     BatchNorm2d-113          [16, 256, 13, 13]             512
       LeakyReLU-114          [16, 256, 13, 13]               0
        CNNBlock-115          [16, 256, 13, 13]               0
          Conv2d-116          [16, 512, 13, 13]       1,179,648
     BatchNorm2d-117          [16, 512, 13, 13]           1,024
       LeakyReLU-118          [16, 512, 13, 13]               0
        CNNBlock-119          [16, 512, 13, 13]               0
          Conv2d-120           [16, 24, 13, 13]          12,312
        CNNBlock-121           [16, 24, 13, 13]               0
 ScalePrediction-122         [16, 3, 13, 13, 8]               0
          Conv2d-123          [16, 128, 13, 13]          32,768
     BatchNorm2d-124          [16, 128, 13, 13]             256
       LeakyReLU-125          [16, 128, 13, 13]               0
        CNNBlock-126          [16, 128, 13, 13]               0
        Upsample-127          [16, 128, 26, 26]               0
          Conv2d-128          [16, 128, 26, 26]          49,152
     BatchNorm2d-129          [16, 128, 26, 26]             256
       LeakyReLU-130          [16, 128, 26, 26]               0
        CNNBlock-131          [16, 128, 26, 26]               0
          Conv2d-132          [16, 256, 26, 26]         294,912
     BatchNorm2d-133          [16, 256, 26, 26]             512
       LeakyReLU-134          [16, 256, 26, 26]               0
        CNNBlock-135          [16, 256, 26, 26]               0
          Conv2d-136          [16, 128, 26, 26]          32,768
     BatchNorm2d-137          [16, 128, 26, 26]             256
       LeakyReLU-138          [16, 128, 26, 26]               0
        CNNBlock-139          [16, 128, 26, 26]               0
          Conv2d-140          [16, 256, 26, 26]         294,912
     BatchNorm2d-141          [16, 256, 26, 26]             512
       LeakyReLU-142          [16, 256, 26, 26]               0
        CNNBlock-143          [16, 256, 26, 26]               0
   ResidualBlock-144          [16, 256, 26, 26]               0
          Conv2d-145          [16, 128, 26, 26]          32,768
     BatchNorm2d-146          [16, 128, 26, 26]             256
       LeakyReLU-147          [16, 128, 26, 26]               0
        CNNBlock-148          [16, 128, 26, 26]               0
          Conv2d-149          [16, 256, 26, 26]         294,912
     BatchNorm2d-150          [16, 256, 26, 26]             512
       LeakyReLU-151          [16, 256, 26, 26]               0
        CNNBlock-152          [16, 256, 26, 26]               0
          Conv2d-153           [16, 24, 26, 26]           6,168
        CNNBlock-154           [16, 24, 26, 26]               0
 ScalePrediction-155         [16, 3, 26, 26, 8]               0
          Conv2d-156           [16, 64, 26, 26]           8,192
     BatchNorm2d-157           [16, 64, 26, 26]             128
       LeakyReLU-158           [16, 64, 26, 26]               0
        CNNBlock-159           [16, 64, 26, 26]               0
        Upsample-160           [16, 64, 52, 52]               0
          Conv2d-161           [16, 64, 52, 52]          12,288
     BatchNorm2d-162           [16, 64, 52, 52]             128
       LeakyReLU-163           [16, 64, 52, 52]               0
        CNNBlock-164           [16, 64, 52, 52]               0
          Conv2d-165          [16, 128, 52, 52]          73,728
     BatchNorm2d-166          [16, 128, 52, 52]             256
       LeakyReLU-167          [16, 128, 52, 52]               0
        CNNBlock-168          [16, 128, 52, 52]               0
          Conv2d-169           [16, 64, 52, 52]           8,192
     BatchNorm2d-170           [16, 64, 52, 52]             128
       LeakyReLU-171           [16, 64, 52, 52]               0
        CNNBlock-172           [16, 64, 52, 52]               0
          Conv2d-173          [16, 128, 52, 52]          73,728
     BatchNorm2d-174          [16, 128, 52, 52]             256
       LeakyReLU-175          [16, 128, 52, 52]               0
        CNNBlock-176          [16, 128, 52, 52]               0
   ResidualBlock-177          [16, 128, 52, 52]               0
          Conv2d-178           [16, 64, 52, 52]           8,192
     BatchNorm2d-179           [16, 64, 52, 52]             128
       LeakyReLU-180           [16, 64, 52, 52]               0
        CNNBlock-181           [16, 64, 52, 52]               0
          Conv2d-182          [16, 128, 52, 52]          73,728
     BatchNorm2d-183          [16, 128, 52, 52]             256
       LeakyReLU-184          [16, 128, 52, 52]               0
        CNNBlock-185          [16, 128, 52, 52]               0
          Conv2d-186           [16, 24, 52, 52]           3,096
        CNNBlock-187           [16, 24, 52, 52]               0
 ScalePrediction-188         [16, 3, 52, 52, 8]               0
================================================================
Total params: 8,987,176
Trainable params: 8,987,176
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 31.69
Forward/backward pass size (MB): 9199.44
Params size (MB): 34.28
Estimated Total Size (MB): 9265.41
----------------------------------------------------------------



config = [
    (16, 3, 1),  
    ["B", 1],
    (32, 3, 2),
    ["B", 1],
    (64, 3, 2),
    ["B", 1],
    (128, 3, 2),  ## 1 
    ["B", 2],     
    (256, 3, 2),  ## 2 
    ["B", 2],     
    (512, 3, 2),  ## 3 
    ["B", 1],     
    (256, 1, 1),  
    (512, 3, 1),  ## 3 
    "S",
    (128, 1, 1),
    "U",
    (128, 1, 1),
    (256, 3, 1),  ## 2 
    "S",
    (64, 1, 1),
    "U",
    (64, 1, 1),
    (128, 3, 1),  ## 1 
    "S",
]


