(pt3.7) C:\Users\paulc\Downloads\YOLOv3>C:/Users/paulc/.conda/envs/pt3.7/python.exe c:/Users/paulc/Downloads/YOLOv3/YOLOv3-CARRADA/model.py
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1          [16, 8, 416, 416]             216
       BatchNorm2d-2          [16, 8, 416, 416]              16
         LeakyReLU-3          [16, 8, 416, 416]               0
          CNNBlock-4          [16, 8, 416, 416]               0
            Conv2d-5         [16, 16, 208, 208]           1,152
       BatchNorm2d-6         [16, 16, 208, 208]              32
         LeakyReLU-7         [16, 16, 208, 208]               0
          CNNBlock-8         [16, 16, 208, 208]               0
            Conv2d-9          [16, 8, 208, 208]             128
      BatchNorm2d-10          [16, 8, 208, 208]              16
        LeakyReLU-11          [16, 8, 208, 208]               0
         CNNBlock-12          [16, 8, 208, 208]               0
           Conv2d-13         [16, 16, 208, 208]           1,152
      BatchNorm2d-14         [16, 16, 208, 208]              32
        LeakyReLU-15         [16, 16, 208, 208]               0
         CNNBlock-16         [16, 16, 208, 208]               0
    ResidualBlock-17         [16, 16, 208, 208]               0
           Conv2d-18         [16, 32, 104, 104]           4,608
      BatchNorm2d-19         [16, 32, 104, 104]              64
        LeakyReLU-20         [16, 32, 104, 104]               0
         CNNBlock-21         [16, 32, 104, 104]               0
           Conv2d-22         [16, 16, 104, 104]             512
      BatchNorm2d-23         [16, 16, 104, 104]              32
        LeakyReLU-24         [16, 16, 104, 104]               0
         CNNBlock-25         [16, 16, 104, 104]               0
           Conv2d-26         [16, 32, 104, 104]           4,608
      BatchNorm2d-27         [16, 32, 104, 104]              64
        LeakyReLU-28         [16, 32, 104, 104]               0
         CNNBlock-29         [16, 32, 104, 104]               0
    ResidualBlock-30         [16, 32, 104, 104]               0
           Conv2d-31           [16, 64, 52, 52]          18,432
      BatchNorm2d-32           [16, 64, 52, 52]             128
        LeakyReLU-33           [16, 64, 52, 52]               0
         CNNBlock-34           [16, 64, 52, 52]               0
           Conv2d-35           [16, 32, 52, 52]           2,048
      BatchNorm2d-36           [16, 32, 52, 52]              64
        LeakyReLU-37           [16, 32, 52, 52]               0
         CNNBlock-38           [16, 32, 52, 52]               0
           Conv2d-39           [16, 64, 52, 52]          18,432
      BatchNorm2d-40           [16, 64, 52, 52]             128
        LeakyReLU-41           [16, 64, 52, 52]               0
         CNNBlock-42           [16, 64, 52, 52]               0
           Conv2d-43           [16, 32, 52, 52]           2,048
      BatchNorm2d-44           [16, 32, 52, 52]              64
        LeakyReLU-45           [16, 32, 52, 52]               0
         CNNBlock-46           [16, 32, 52, 52]               0
           Conv2d-47           [16, 64, 52, 52]          18,432
      BatchNorm2d-48           [16, 64, 52, 52]             128
        LeakyReLU-49           [16, 64, 52, 52]               0
         CNNBlock-50           [16, 64, 52, 52]               0
    ResidualBlock-51           [16, 64, 52, 52]               0
           Conv2d-52          [16, 128, 26, 26]          73,728
      BatchNorm2d-53          [16, 128, 26, 26]             256
        LeakyReLU-54          [16, 128, 26, 26]               0
         CNNBlock-55          [16, 128, 26, 26]               0
           Conv2d-56           [16, 64, 26, 26]           8,192
      BatchNorm2d-57           [16, 64, 26, 26]             128
        LeakyReLU-58           [16, 64, 26, 26]               0
         CNNBlock-59           [16, 64, 26, 26]               0
           Conv2d-60          [16, 128, 26, 26]          73,728
      BatchNorm2d-61          [16, 128, 26, 26]             256
        LeakyReLU-62          [16, 128, 26, 26]               0
         CNNBlock-63          [16, 128, 26, 26]               0
           Conv2d-64           [16, 64, 26, 26]           8,192
      BatchNorm2d-65           [16, 64, 26, 26]             128
        LeakyReLU-66           [16, 64, 26, 26]               0
         CNNBlock-67           [16, 64, 26, 26]               0
           Conv2d-68          [16, 128, 26, 26]          73,728
      BatchNorm2d-69          [16, 128, 26, 26]             256
        LeakyReLU-70          [16, 128, 26, 26]               0
         CNNBlock-71          [16, 128, 26, 26]               0
    ResidualBlock-72          [16, 128, 26, 26]               0
           Conv2d-73          [16, 256, 13, 13]         294,912
      BatchNorm2d-74          [16, 256, 13, 13]             512
        LeakyReLU-75          [16, 256, 13, 13]               0
         CNNBlock-76          [16, 256, 13, 13]               0
           Conv2d-77          [16, 128, 13, 13]          32,768
      BatchNorm2d-78          [16, 128, 13, 13]             256
        LeakyReLU-79          [16, 128, 13, 13]               0
         CNNBlock-80          [16, 128, 13, 13]               0
           Conv2d-81          [16, 256, 13, 13]         294,912
      BatchNorm2d-82          [16, 256, 13, 13]             512
        LeakyReLU-83          [16, 256, 13, 13]               0
         CNNBlock-84          [16, 256, 13, 13]               0
    ResidualBlock-85          [16, 256, 13, 13]               0
           Conv2d-86          [16, 128, 13, 13]          32,768
      BatchNorm2d-87          [16, 128, 13, 13]             256
        LeakyReLU-88          [16, 128, 13, 13]               0
         CNNBlock-89          [16, 128, 13, 13]               0
           Conv2d-90          [16, 256, 13, 13]         294,912
      BatchNorm2d-91          [16, 256, 13, 13]             512
        LeakyReLU-92          [16, 256, 13, 13]               0
         CNNBlock-93          [16, 256, 13, 13]               0
           Conv2d-94          [16, 128, 13, 13]          32,768
      BatchNorm2d-95          [16, 128, 13, 13]             256
        LeakyReLU-96          [16, 128, 13, 13]               0
         CNNBlock-97          [16, 128, 13, 13]               0
           Conv2d-98          [16, 256, 13, 13]         294,912
      BatchNorm2d-99          [16, 256, 13, 13]             512
       LeakyReLU-100          [16, 256, 13, 13]               0
        CNNBlock-101          [16, 256, 13, 13]               0
   ResidualBlock-102          [16, 256, 13, 13]               0
          Conv2d-103          [16, 128, 13, 13]          32,768
     BatchNorm2d-104          [16, 128, 13, 13]             256
       LeakyReLU-105          [16, 128, 13, 13]               0
        CNNBlock-106          [16, 128, 13, 13]               0
          Conv2d-107          [16, 256, 13, 13]         294,912
     BatchNorm2d-108          [16, 256, 13, 13]             512
       LeakyReLU-109          [16, 256, 13, 13]               0
        CNNBlock-110          [16, 256, 13, 13]               0
          Conv2d-111           [16, 24, 13, 13]           6,168
        CNNBlock-112           [16, 24, 13, 13]               0
 ScalePrediction-113         [16, 3, 13, 13, 8]               0
          Conv2d-114           [16, 64, 13, 13]           8,192
     BatchNorm2d-115           [16, 64, 13, 13]             128
       LeakyReLU-116           [16, 64, 13, 13]               0
        CNNBlock-117           [16, 64, 13, 13]               0
        Upsample-118           [16, 64, 26, 26]               0
          Conv2d-119           [16, 64, 26, 26]          12,288
     BatchNorm2d-120           [16, 64, 26, 26]             128
       LeakyReLU-121           [16, 64, 26, 26]               0
        CNNBlock-122           [16, 64, 26, 26]               0
          Conv2d-123          [16, 128, 26, 26]          73,728
     BatchNorm2d-124          [16, 128, 26, 26]             256
       LeakyReLU-125          [16, 128, 26, 26]               0
        CNNBlock-126          [16, 128, 26, 26]               0
          Conv2d-127           [16, 64, 26, 26]           8,192
     BatchNorm2d-128           [16, 64, 26, 26]             128
       LeakyReLU-129           [16, 64, 26, 26]               0
        CNNBlock-130           [16, 64, 26, 26]               0
          Conv2d-131          [16, 128, 26, 26]          73,728
     BatchNorm2d-132          [16, 128, 26, 26]             256
       LeakyReLU-133          [16, 128, 26, 26]               0
        CNNBlock-134          [16, 128, 26, 26]               0
   ResidualBlock-135          [16, 128, 26, 26]               0
          Conv2d-136           [16, 64, 26, 26]           8,192
     BatchNorm2d-137           [16, 64, 26, 26]             128
       LeakyReLU-138           [16, 64, 26, 26]               0
        CNNBlock-139           [16, 64, 26, 26]               0
          Conv2d-140          [16, 128, 26, 26]          73,728
     BatchNorm2d-141          [16, 128, 26, 26]             256
       LeakyReLU-142          [16, 128, 26, 26]               0
        CNNBlock-143          [16, 128, 26, 26]               0
          Conv2d-144           [16, 24, 26, 26]           3,096
        CNNBlock-145           [16, 24, 26, 26]               0
 ScalePrediction-146         [16, 3, 26, 26, 8]               0
          Conv2d-147           [16, 32, 26, 26]           2,048
     BatchNorm2d-148           [16, 32, 26, 26]              64
       LeakyReLU-149           [16, 32, 26, 26]               0
        CNNBlock-150           [16, 32, 26, 26]               0
        Upsample-151           [16, 32, 52, 52]               0
          Conv2d-152           [16, 32, 52, 52]           3,072
     BatchNorm2d-153           [16, 32, 52, 52]              64
       LeakyReLU-154           [16, 32, 52, 52]               0
        CNNBlock-155           [16, 32, 52, 52]               0
          Conv2d-156           [16, 64, 52, 52]          18,432
     BatchNorm2d-157           [16, 64, 52, 52]             128
       LeakyReLU-158           [16, 64, 52, 52]               0
        CNNBlock-159           [16, 64, 52, 52]               0
          Conv2d-160           [16, 32, 52, 52]           2,048
     BatchNorm2d-161           [16, 32, 52, 52]              64
       LeakyReLU-162           [16, 32, 52, 52]               0
        CNNBlock-163           [16, 32, 52, 52]               0
          Conv2d-164           [16, 64, 52, 52]          18,432
     BatchNorm2d-165           [16, 64, 52, 52]             128
       LeakyReLU-166           [16, 64, 52, 52]               0
        CNNBlock-167           [16, 64, 52, 52]               0
   ResidualBlock-168           [16, 64, 52, 52]               0
          Conv2d-169           [16, 32, 52, 52]           2,048
     BatchNorm2d-170           [16, 32, 52, 52]              64
       LeakyReLU-171           [16, 32, 52, 52]               0
        CNNBlock-172           [16, 32, 52, 52]               0
          Conv2d-173           [16, 64, 52, 52]          18,432
     BatchNorm2d-174           [16, 64, 52, 52]             128
       LeakyReLU-175           [16, 64, 52, 52]               0
        CNNBlock-176           [16, 64, 52, 52]               0
          Conv2d-177           [16, 24, 52, 52]           1,560
        CNNBlock-178           [16, 24, 52, 52]               0
 ScalePrediction-179         [16, 3, 52, 52, 8]               0
================================================================
Total params: 2,255,648
Trainable params: 2,255,648
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 31.69
Forward/backward pass size (MB): 3432.32
Params size (MB): 8.60
Estimated Total Size (MB): 3472.61
----------------------------------------------------------------



config = [
    (8, 3, 1),   
    (16, 3, 2),
    ["B", 1],
    (32, 3, 2),
    ["B", 1],
    (64, 3, 2),   ## 1 
    ["B", 2],     
    (128, 3, 2),  ## 2 
    ["B", 2],     
    (256, 3, 2),  ## 3 
    ["B", 1],     
    (128, 1, 1),  
    (256, 3, 1),  ## 3 
    "S",
    (64, 1, 1),
    "U",
    (64, 1, 1),
    (128, 3, 1),  ## 2 
    "S",
    (32, 1, 1),
    "U",
    (32, 1, 1),
    (64, 3, 1),   ## 1 
    "S",
]

