----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [16, 16, 416, 416]             432
       BatchNorm2d-2         [16, 16, 416, 416]              32
         LeakyReLU-3         [16, 16, 416, 416]               0
          CNNBlock-4         [16, 16, 416, 416]               0
            Conv2d-5          [16, 8, 416, 416]             128
       BatchNorm2d-6          [16, 8, 416, 416]              16
         LeakyReLU-7          [16, 8, 416, 416]               0
          CNNBlock-8          [16, 8, 416, 416]               0
            Conv2d-9         [16, 16, 416, 416]           1,152
      BatchNorm2d-10         [16, 16, 416, 416]              32
        LeakyReLU-11         [16, 16, 416, 416]               0
         CNNBlock-12         [16, 16, 416, 416]               0
    ResidualBlock-13         [16, 16, 416, 416]               0
           Conv2d-14         [16, 32, 208, 208]           4,608
      BatchNorm2d-15         [16, 32, 208, 208]              64
        LeakyReLU-16         [16, 32, 208, 208]               0
         CNNBlock-17         [16, 32, 208, 208]               0
           Conv2d-18         [16, 16, 208, 208]             512
      BatchNorm2d-19         [16, 16, 208, 208]              32
        LeakyReLU-20         [16, 16, 208, 208]               0
         CNNBlock-21         [16, 16, 208, 208]               0
           Conv2d-22         [16, 32, 208, 208]           4,608
      BatchNorm2d-23         [16, 32, 208, 208]              64
        LeakyReLU-24         [16, 32, 208, 208]               0
         CNNBlock-25         [16, 32, 208, 208]               0
    ResidualBlock-26         [16, 32, 208, 208]               0
           Conv2d-27         [16, 64, 104, 104]          18,432
      BatchNorm2d-28         [16, 64, 104, 104]             128
        LeakyReLU-29         [16, 64, 104, 104]               0
         CNNBlock-30         [16, 64, 104, 104]               0
           Conv2d-31         [16, 32, 104, 104]           2,048
      BatchNorm2d-32         [16, 32, 104, 104]              64
        LeakyReLU-33         [16, 32, 104, 104]               0
         CNNBlock-34         [16, 32, 104, 104]               0
           Conv2d-35         [16, 64, 104, 104]          18,432
      BatchNorm2d-36         [16, 64, 104, 104]             128
        LeakyReLU-37         [16, 64, 104, 104]               0
         CNNBlock-38         [16, 64, 104, 104]               0
    ResidualBlock-39         [16, 64, 104, 104]               0
           Conv2d-40          [16, 128, 52, 52]          73,728
      BatchNorm2d-41          [16, 128, 52, 52]             256
        LeakyReLU-42          [16, 128, 52, 52]               0
         CNNBlock-43          [16, 128, 52, 52]               0
           Conv2d-44           [16, 64, 52, 52]           8,192
      BatchNorm2d-45           [16, 64, 52, 52]             128
        LeakyReLU-46           [16, 64, 52, 52]               0
         CNNBlock-47           [16, 64, 52, 52]               0
           Conv2d-48          [16, 128, 52, 52]          73,728
      BatchNorm2d-49          [16, 128, 52, 52]             256
        LeakyReLU-50          [16, 128, 52, 52]               0
         CNNBlock-51          [16, 128, 52, 52]               0
           Conv2d-52           [16, 64, 52, 52]           8,192
      BatchNorm2d-53           [16, 64, 52, 52]             128
        LeakyReLU-54           [16, 64, 52, 52]               0
         CNNBlock-55           [16, 64, 52, 52]               0
           Conv2d-56          [16, 128, 52, 52]          73,728
      BatchNorm2d-57          [16, 128, 52, 52]             256
        LeakyReLU-58          [16, 128, 52, 52]               0
         CNNBlock-59          [16, 128, 52, 52]               0
           Conv2d-60           [16, 64, 52, 52]           8,192
      BatchNorm2d-61           [16, 64, 52, 52]             128
        LeakyReLU-62           [16, 64, 52, 52]               0
         CNNBlock-63           [16, 64, 52, 52]               0
           Conv2d-64          [16, 128, 52, 52]          73,728
      BatchNorm2d-65          [16, 128, 52, 52]             256
        LeakyReLU-66          [16, 128, 52, 52]               0
         CNNBlock-67          [16, 128, 52, 52]               0
           Conv2d-68           [16, 64, 52, 52]           8,192
      BatchNorm2d-69           [16, 64, 52, 52]             128
        LeakyReLU-70           [16, 64, 52, 52]               0
         CNNBlock-71           [16, 64, 52, 52]               0
           Conv2d-72          [16, 128, 52, 52]          73,728
      BatchNorm2d-73          [16, 128, 52, 52]             256
        LeakyReLU-74          [16, 128, 52, 52]               0
         CNNBlock-75          [16, 128, 52, 52]               0
    ResidualBlock-76          [16, 128, 52, 52]               0
           Conv2d-77          [16, 256, 26, 26]         294,912
      BatchNorm2d-78          [16, 256, 26, 26]             512
        LeakyReLU-79          [16, 256, 26, 26]               0
         CNNBlock-80          [16, 256, 26, 26]               0
           Conv2d-81          [16, 128, 26, 26]          32,768
      BatchNorm2d-82          [16, 128, 26, 26]             256
        LeakyReLU-83          [16, 128, 26, 26]               0
         CNNBlock-84          [16, 128, 26, 26]               0
           Conv2d-85          [16, 256, 26, 26]         294,912
      BatchNorm2d-86          [16, 256, 26, 26]             512
        LeakyReLU-87          [16, 256, 26, 26]               0
         CNNBlock-88          [16, 256, 26, 26]               0
           Conv2d-89          [16, 128, 26, 26]          32,768
      BatchNorm2d-90          [16, 128, 26, 26]             256
        LeakyReLU-91          [16, 128, 26, 26]               0
         CNNBlock-92          [16, 128, 26, 26]               0
           Conv2d-93          [16, 256, 26, 26]         294,912
      BatchNorm2d-94          [16, 256, 26, 26]             512
        LeakyReLU-95          [16, 256, 26, 26]               0
         CNNBlock-96          [16, 256, 26, 26]               0
           Conv2d-97          [16, 128, 26, 26]          32,768
      BatchNorm2d-98          [16, 128, 26, 26]             256
        LeakyReLU-99          [16, 128, 26, 26]               0
        CNNBlock-100          [16, 128, 26, 26]               0
          Conv2d-101          [16, 256, 26, 26]         294,912
     BatchNorm2d-102          [16, 256, 26, 26]             512
       LeakyReLU-103          [16, 256, 26, 26]               0
        CNNBlock-104          [16, 256, 26, 26]               0
          Conv2d-105          [16, 128, 26, 26]          32,768
     BatchNorm2d-106          [16, 128, 26, 26]             256
       LeakyReLU-107          [16, 128, 26, 26]               0
        CNNBlock-108          [16, 128, 26, 26]               0
          Conv2d-109          [16, 256, 26, 26]         294,912
     BatchNorm2d-110          [16, 256, 26, 26]             512
       LeakyReLU-111          [16, 256, 26, 26]               0
        CNNBlock-112          [16, 256, 26, 26]               0
   ResidualBlock-113          [16, 256, 26, 26]               0
          Conv2d-114          [16, 512, 13, 13]       1,179,648
     BatchNorm2d-115          [16, 512, 13, 13]           1,024
       LeakyReLU-116          [16, 512, 13, 13]               0
        CNNBlock-117          [16, 512, 13, 13]               0
          Conv2d-118          [16, 256, 13, 13]         131,072
     BatchNorm2d-119          [16, 256, 13, 13]             512
       LeakyReLU-120          [16, 256, 13, 13]               0
        CNNBlock-121          [16, 256, 13, 13]               0
          Conv2d-122          [16, 512, 13, 13]       1,179,648
     BatchNorm2d-123          [16, 512, 13, 13]           1,024
       LeakyReLU-124          [16, 512, 13, 13]               0
        CNNBlock-125          [16, 512, 13, 13]               0
   ResidualBlock-126          [16, 512, 13, 13]               0
          Conv2d-127          [16, 256, 13, 13]         131,072
     BatchNorm2d-128          [16, 256, 13, 13]             512
       LeakyReLU-129          [16, 256, 13, 13]               0
        CNNBlock-130          [16, 256, 13, 13]               0
          Conv2d-131          [16, 512, 13, 13]       1,179,648
     BatchNorm2d-132          [16, 512, 13, 13]           1,024
       LeakyReLU-133          [16, 512, 13, 13]               0
        CNNBlock-134          [16, 512, 13, 13]               0
          Conv2d-135          [16, 256, 13, 13]         131,072
     BatchNorm2d-136          [16, 256, 13, 13]             512
       LeakyReLU-137          [16, 256, 13, 13]               0
        CNNBlock-138          [16, 256, 13, 13]               0
          Conv2d-139          [16, 512, 13, 13]       1,179,648
     BatchNorm2d-140          [16, 512, 13, 13]           1,024
       LeakyReLU-141          [16, 512, 13, 13]               0
        CNNBlock-142          [16, 512, 13, 13]               0
   ResidualBlock-143          [16, 512, 13, 13]               0
          Conv2d-144          [16, 256, 13, 13]         131,072
     BatchNorm2d-145          [16, 256, 13, 13]             512
       LeakyReLU-146          [16, 256, 13, 13]               0
        CNNBlock-147          [16, 256, 13, 13]               0
          Conv2d-148          [16, 512, 13, 13]       1,179,648
     BatchNorm2d-149          [16, 512, 13, 13]           1,024
       LeakyReLU-150          [16, 512, 13, 13]               0
        CNNBlock-151          [16, 512, 13, 13]               0
          Conv2d-152           [16, 24, 13, 13]          12,312
        CNNBlock-153           [16, 24, 13, 13]               0
 ScalePrediction-154         [16, 3, 13, 13, 8]               0
          Conv2d-155          [16, 128, 13, 13]          32,768
     BatchNorm2d-156          [16, 128, 13, 13]             256
       LeakyReLU-157          [16, 128, 13, 13]               0
        CNNBlock-158          [16, 128, 13, 13]               0
        Upsample-159          [16, 128, 26, 26]               0
          Conv2d-160          [16, 128, 26, 26]          49,152
     BatchNorm2d-161          [16, 128, 26, 26]             256
       LeakyReLU-162          [16, 128, 26, 26]               0
        CNNBlock-163          [16, 128, 26, 26]               0
          Conv2d-164          [16, 256, 26, 26]         294,912
     BatchNorm2d-165          [16, 256, 26, 26]             512
       LeakyReLU-166          [16, 256, 26, 26]               0
        CNNBlock-167          [16, 256, 26, 26]               0
          Conv2d-168          [16, 128, 26, 26]          32,768
     BatchNorm2d-169          [16, 128, 26, 26]             256
       LeakyReLU-170          [16, 128, 26, 26]               0
        CNNBlock-171          [16, 128, 26, 26]               0
          Conv2d-172          [16, 256, 26, 26]         294,912
     BatchNorm2d-173          [16, 256, 26, 26]             512
       LeakyReLU-174          [16, 256, 26, 26]               0
        CNNBlock-175          [16, 256, 26, 26]               0
   ResidualBlock-176          [16, 256, 26, 26]               0
          Conv2d-177          [16, 128, 26, 26]          32,768
     BatchNorm2d-178          [16, 128, 26, 26]             256
       LeakyReLU-179          [16, 128, 26, 26]               0
        CNNBlock-180          [16, 128, 26, 26]               0
          Conv2d-181          [16, 256, 26, 26]         294,912
     BatchNorm2d-182          [16, 256, 26, 26]             512
       LeakyReLU-183          [16, 256, 26, 26]               0
        CNNBlock-184          [16, 256, 26, 26]               0
          Conv2d-185           [16, 24, 26, 26]           6,168
        CNNBlock-186           [16, 24, 26, 26]               0
 ScalePrediction-187         [16, 3, 26, 26, 8]               0
          Conv2d-188           [16, 64, 26, 26]           8,192
     BatchNorm2d-189           [16, 64, 26, 26]             128
       LeakyReLU-190           [16, 64, 26, 26]               0
        CNNBlock-191           [16, 64, 26, 26]               0
        Upsample-192           [16, 64, 52, 52]               0
          Conv2d-193           [16, 64, 52, 52]          12,288
     BatchNorm2d-194           [16, 64, 52, 52]             128
       LeakyReLU-195           [16, 64, 52, 52]               0
        CNNBlock-196           [16, 64, 52, 52]               0
          Conv2d-197          [16, 128, 52, 52]          73,728
     BatchNorm2d-198          [16, 128, 52, 52]             256
       LeakyReLU-199          [16, 128, 52, 52]               0
        CNNBlock-200          [16, 128, 52, 52]               0
          Conv2d-201           [16, 64, 52, 52]           8,192
     BatchNorm2d-202           [16, 64, 52, 52]             128
       LeakyReLU-203           [16, 64, 52, 52]               0
        CNNBlock-204           [16, 64, 52, 52]               0
          Conv2d-205          [16, 128, 52, 52]          73,728
     BatchNorm2d-206          [16, 128, 52, 52]             256
       LeakyReLU-207          [16, 128, 52, 52]               0
        CNNBlock-208          [16, 128, 52, 52]               0
   ResidualBlock-209          [16, 128, 52, 52]               0
          Conv2d-210           [16, 64, 52, 52]           8,192
     BatchNorm2d-211           [16, 64, 52, 52]             128
       LeakyReLU-212           [16, 64, 52, 52]               0
        CNNBlock-213           [16, 64, 52, 52]               0
          Conv2d-214          [16, 128, 52, 52]          73,728
     BatchNorm2d-215          [16, 128, 52, 52]             256
       LeakyReLU-216          [16, 128, 52, 52]               0
        CNNBlock-217          [16, 128, 52, 52]               0
          Conv2d-218           [16, 24, 52, 52]           3,096
        CNNBlock-219           [16, 24, 52, 52]               0
 ScalePrediction-220         [16, 3, 52, 52, 8]               0
================================================================
Total params: 9,808,680
Trainable params: 9,808,680
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 31.69
Forward/backward pass size (MB): 9959.94
Params size (MB): 37.42
Estimated Total Size (MB): 10029.05
----------------------------------------------------------------



config = [
    (16, 3, 1),  
    ["B", 1],
    (32, 3, 2),
    ["B", 1],
    (64, 3, 2),
    ["B", 1],
    (128, 3, 2),  ## 1 
    ["B", 4],     
    (256, 3, 2),  ## 2 
    ["B", 4],     
    (512, 3, 2),  ## 3 
    ["B", 1],  
    # to this point is the feature extractor (Darknet-53)   
    (256, 1, 1),  
    (512, 3, 1),  ## 3 
    "S",
    (128, 1, 1),
    "U",
    (128, 1, 1),
    (256, 3, 1),  ## 2 
    "S",
    (64, 1, 1),
    "U",
    (64, 1, 1),
    (128, 3, 1),  ## 1 
    "S",
]


