(pt3.7) C:\Users\paulc\Downloads\YOLOv3>C:/Users/paulc/.conda/envs/pt3.7/python.exe c:/Users/paulc/Downloads/YOLOv3/YOLOv3-CARRADA/model.py
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1          [16, 8, 416, 416]             216
       BatchNorm2d-2          [16, 8, 416, 416]              16
         LeakyReLU-3          [16, 8, 416, 416]               0
          CNNBlock-4          [16, 8, 416, 416]               0
            Conv2d-5         [16, 16, 208, 208]           1,152
       BatchNorm2d-6         [16, 16, 208, 208]              32
         LeakyReLU-7         [16, 16, 208, 208]               0
          CNNBlock-8         [16, 16, 208, 208]               0
            Conv2d-9         [16, 32, 104, 104]           4,608
      BatchNorm2d-10         [16, 32, 104, 104]              64
        LeakyReLU-11         [16, 32, 104, 104]               0
         CNNBlock-12         [16, 32, 104, 104]               0
           Conv2d-13           [16, 64, 52, 52]          18,432
      BatchNorm2d-14           [16, 64, 52, 52]             128
        LeakyReLU-15           [16, 64, 52, 52]               0
         CNNBlock-16           [16, 64, 52, 52]               0
           Conv2d-17           [16, 32, 52, 52]           2,048
      BatchNorm2d-18           [16, 32, 52, 52]              64
        LeakyReLU-19           [16, 32, 52, 52]               0
         CNNBlock-20           [16, 32, 52, 52]               0
           Conv2d-21           [16, 64, 52, 52]          18,432
      BatchNorm2d-22           [16, 64, 52, 52]             128
        LeakyReLU-23           [16, 64, 52, 52]               0
         CNNBlock-24           [16, 64, 52, 52]               0
           Conv2d-25           [16, 32, 52, 52]           2,048
      BatchNorm2d-26           [16, 32, 52, 52]              64
        LeakyReLU-27           [16, 32, 52, 52]               0
         CNNBlock-28           [16, 32, 52, 52]               0
           Conv2d-29           [16, 64, 52, 52]          18,432
      BatchNorm2d-30           [16, 64, 52, 52]             128
        LeakyReLU-31           [16, 64, 52, 52]               0
         CNNBlock-32           [16, 64, 52, 52]               0
    ResidualBlock-33           [16, 64, 52, 52]               0
           Conv2d-34          [16, 128, 26, 26]          73,728
      BatchNorm2d-35          [16, 128, 26, 26]             256
        LeakyReLU-36          [16, 128, 26, 26]               0
         CNNBlock-37          [16, 128, 26, 26]               0
           Conv2d-38           [16, 64, 26, 26]           8,192
      BatchNorm2d-39           [16, 64, 26, 26]             128
        LeakyReLU-40           [16, 64, 26, 26]               0
         CNNBlock-41           [16, 64, 26, 26]               0
           Conv2d-42          [16, 128, 26, 26]          73,728
      BatchNorm2d-43          [16, 128, 26, 26]             256
        LeakyReLU-44          [16, 128, 26, 26]               0
         CNNBlock-45          [16, 128, 26, 26]               0
           Conv2d-46           [16, 64, 26, 26]           8,192
      BatchNorm2d-47           [16, 64, 26, 26]             128
        LeakyReLU-48           [16, 64, 26, 26]               0
         CNNBlock-49           [16, 64, 26, 26]               0
           Conv2d-50          [16, 128, 26, 26]          73,728
      BatchNorm2d-51          [16, 128, 26, 26]             256
        LeakyReLU-52          [16, 128, 26, 26]               0
         CNNBlock-53          [16, 128, 26, 26]               0
    ResidualBlock-54          [16, 128, 26, 26]               0
           Conv2d-55          [16, 256, 13, 13]         294,912
      BatchNorm2d-56          [16, 256, 13, 13]             512
        LeakyReLU-57          [16, 256, 13, 13]               0
         CNNBlock-58          [16, 256, 13, 13]               0
           Conv2d-59          [16, 128, 13, 13]          32,768
      BatchNorm2d-60          [16, 128, 13, 13]             256
        LeakyReLU-61          [16, 128, 13, 13]               0
         CNNBlock-62          [16, 128, 13, 13]               0
           Conv2d-63          [16, 256, 13, 13]         294,912
      BatchNorm2d-64          [16, 256, 13, 13]             512
        LeakyReLU-65          [16, 256, 13, 13]               0
         CNNBlock-66          [16, 256, 13, 13]               0
    ResidualBlock-67          [16, 256, 13, 13]               0
           Conv2d-68          [16, 128, 13, 13]          32,768
      BatchNorm2d-69          [16, 128, 13, 13]             256
        LeakyReLU-70          [16, 128, 13, 13]               0
         CNNBlock-71          [16, 128, 13, 13]               0
           Conv2d-72          [16, 256, 13, 13]         294,912
      BatchNorm2d-73          [16, 256, 13, 13]             512
        LeakyReLU-74          [16, 256, 13, 13]               0
         CNNBlock-75          [16, 256, 13, 13]               0
           Conv2d-76          [16, 128, 13, 13]          32,768
      BatchNorm2d-77          [16, 128, 13, 13]             256
        LeakyReLU-78          [16, 128, 13, 13]               0
         CNNBlock-79          [16, 128, 13, 13]               0
           Conv2d-80          [16, 256, 13, 13]         294,912
      BatchNorm2d-81          [16, 256, 13, 13]             512
        LeakyReLU-82          [16, 256, 13, 13]               0
         CNNBlock-83          [16, 256, 13, 13]               0
    ResidualBlock-84          [16, 256, 13, 13]               0
           Conv2d-85          [16, 128, 13, 13]          32,768
      BatchNorm2d-86          [16, 128, 13, 13]             256
        LeakyReLU-87          [16, 128, 13, 13]               0
         CNNBlock-88          [16, 128, 13, 13]               0
           Conv2d-89          [16, 256, 13, 13]         294,912
      BatchNorm2d-90          [16, 256, 13, 13]             512
        LeakyReLU-91          [16, 256, 13, 13]               0
         CNNBlock-92          [16, 256, 13, 13]               0
           Conv2d-93           [16, 24, 13, 13]           6,168
         CNNBlock-94           [16, 24, 13, 13]               0
  ScalePrediction-95         [16, 3, 13, 13, 8]               0
           Conv2d-96           [16, 64, 13, 13]           8,192
      BatchNorm2d-97           [16, 64, 13, 13]             128
        LeakyReLU-98           [16, 64, 13, 13]               0
         CNNBlock-99           [16, 64, 13, 13]               0
        Upsample-100           [16, 64, 26, 26]               0
          Conv2d-101           [16, 64, 26, 26]          12,288
     BatchNorm2d-102           [16, 64, 26, 26]             128
       LeakyReLU-103           [16, 64, 26, 26]               0
        CNNBlock-104           [16, 64, 26, 26]               0
          Conv2d-105          [16, 128, 26, 26]          73,728
     BatchNorm2d-106          [16, 128, 26, 26]             256
       LeakyReLU-107          [16, 128, 26, 26]               0
        CNNBlock-108          [16, 128, 26, 26]               0
          Conv2d-109           [16, 64, 26, 26]           8,192
     BatchNorm2d-110           [16, 64, 26, 26]             128
       LeakyReLU-111           [16, 64, 26, 26]               0
        CNNBlock-112           [16, 64, 26, 26]               0
          Conv2d-113          [16, 128, 26, 26]          73,728
     BatchNorm2d-114          [16, 128, 26, 26]             256
       LeakyReLU-115          [16, 128, 26, 26]               0
        CNNBlock-116          [16, 128, 26, 26]               0
   ResidualBlock-117          [16, 128, 26, 26]               0
          Conv2d-118           [16, 64, 26, 26]           8,192
     BatchNorm2d-119           [16, 64, 26, 26]             128
       LeakyReLU-120           [16, 64, 26, 26]               0
        CNNBlock-121           [16, 64, 26, 26]               0
          Conv2d-122          [16, 128, 26, 26]          73,728
     BatchNorm2d-123          [16, 128, 26, 26]             256
       LeakyReLU-124          [16, 128, 26, 26]               0
        CNNBlock-125          [16, 128, 26, 26]               0
          Conv2d-126           [16, 24, 26, 26]           3,096
        CNNBlock-127           [16, 24, 26, 26]               0
 ScalePrediction-128         [16, 3, 26, 26, 8]               0
          Conv2d-129           [16, 32, 26, 26]           2,048
     BatchNorm2d-130           [16, 32, 26, 26]              64
       LeakyReLU-131           [16, 32, 26, 26]               0
        CNNBlock-132           [16, 32, 26, 26]               0
        Upsample-133           [16, 32, 52, 52]               0
          Conv2d-134           [16, 32, 52, 52]           3,072
     BatchNorm2d-135           [16, 32, 52, 52]              64
       LeakyReLU-136           [16, 32, 52, 52]               0
        CNNBlock-137           [16, 32, 52, 52]               0
          Conv2d-138           [16, 64, 52, 52]          18,432
     BatchNorm2d-139           [16, 64, 52, 52]             128
       LeakyReLU-140           [16, 64, 52, 52]               0
        CNNBlock-141           [16, 64, 52, 52]               0
          Conv2d-142           [16, 32, 52, 52]           2,048
     BatchNorm2d-143           [16, 32, 52, 52]              64
       LeakyReLU-144           [16, 32, 52, 52]               0
        CNNBlock-145           [16, 32, 52, 52]               0
          Conv2d-146           [16, 64, 52, 52]          18,432
     BatchNorm2d-147           [16, 64, 52, 52]             128
       LeakyReLU-148           [16, 64, 52, 52]               0
        CNNBlock-149           [16, 64, 52, 52]               0
   ResidualBlock-150           [16, 64, 52, 52]               0
          Conv2d-151           [16, 32, 52, 52]           2,048
     BatchNorm2d-152           [16, 32, 52, 52]              64
       LeakyReLU-153           [16, 32, 52, 52]               0
        CNNBlock-154           [16, 32, 52, 52]               0
          Conv2d-155           [16, 64, 52, 52]          18,432
     BatchNorm2d-156           [16, 64, 52, 52]             128
       LeakyReLU-157           [16, 64, 52, 52]               0
        CNNBlock-158           [16, 64, 52, 52]               0
          Conv2d-159           [16, 24, 52, 52]           1,560
        CNNBlock-160           [16, 24, 52, 52]               0
 ScalePrediction-161         [16, 3, 52, 52, 8]               0
================================================================
Total params: 2,249,104
Trainable params: 2,249,104
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 31.69
Forward/backward pass size (MB): 2545.07
Params size (MB): 8.58
Estimated Total Size (MB): 2585.33
----------------------------------------------------------------


config = [
    (8, 3, 1),   
    (16, 3, 2),
    (32, 3, 2),
    (64, 3, 2),   ## 1 
    ["B", 2],     
    (128, 3, 2),  ## 2 
    ["B", 2],     
    (256, 3, 2),  ## 3 
    ["B", 1],     
    (128, 1, 1),  
    (256, 3, 1),  ## 3 
    "S",
    (64, 1, 1),
    "U",
    (64, 1, 1),
    (128, 3, 1),  ## 2 
    "S",
    (32, 1, 1),
    "U",
    (32, 1, 1),
    (64, 3, 1),   ## 1 
    "S",
]

