----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [20, 32, 416, 416]             864
       BatchNorm2d-2         [20, 32, 416, 416]              64
         LeakyReLU-3         [20, 32, 416, 416]               0
          CNNBlock-4         [20, 32, 416, 416]               0
            Conv2d-5         [20, 64, 208, 208]          18,432
       BatchNorm2d-6         [20, 64, 208, 208]             128
         LeakyReLU-7         [20, 64, 208, 208]               0
          CNNBlock-8         [20, 64, 208, 208]               0
            Conv2d-9         [20, 32, 208, 208]           2,048
      BatchNorm2d-10         [20, 32, 208, 208]              64
        LeakyReLU-11         [20, 32, 208, 208]               0
         CNNBlock-12         [20, 32, 208, 208]               0
           Conv2d-13         [20, 64, 208, 208]          18,432
      BatchNorm2d-14         [20, 64, 208, 208]             128
        LeakyReLU-15         [20, 64, 208, 208]               0
         CNNBlock-16         [20, 64, 208, 208]               0
    ResidualBlock-17         [20, 64, 208, 208]               0
           Conv2d-18        [20, 128, 104, 104]          73,728
      BatchNorm2d-19        [20, 128, 104, 104]             256
        LeakyReLU-20        [20, 128, 104, 104]               0
         CNNBlock-21        [20, 128, 104, 104]               0
           Conv2d-22         [20, 64, 104, 104]           8,192
      BatchNorm2d-23         [20, 64, 104, 104]             128
        LeakyReLU-24         [20, 64, 104, 104]               0
         CNNBlock-25         [20, 64, 104, 104]               0
           Conv2d-26        [20, 128, 104, 104]          73,728
      BatchNorm2d-27        [20, 128, 104, 104]             256
        LeakyReLU-28        [20, 128, 104, 104]               0
         CNNBlock-29        [20, 128, 104, 104]               0
           Conv2d-30         [20, 64, 104, 104]           8,192
      BatchNorm2d-31         [20, 64, 104, 104]             128
        LeakyReLU-32         [20, 64, 104, 104]               0
         CNNBlock-33         [20, 64, 104, 104]               0
           Conv2d-34        [20, 128, 104, 104]          73,728
      BatchNorm2d-35        [20, 128, 104, 104]             256
        LeakyReLU-36        [20, 128, 104, 104]               0
         CNNBlock-37        [20, 128, 104, 104]               0
    ResidualBlock-38        [20, 128, 104, 104]               0
           Conv2d-39          [20, 256, 52, 52]         294,912
      BatchNorm2d-40          [20, 256, 52, 52]             512
        LeakyReLU-41          [20, 256, 52, 52]               0
         CNNBlock-42          [20, 256, 52, 52]               0
           Conv2d-43          [20, 128, 52, 52]          32,768
      BatchNorm2d-44          [20, 128, 52, 52]             256
        LeakyReLU-45          [20, 128, 52, 52]               0
         CNNBlock-46          [20, 128, 52, 52]               0
           Conv2d-47          [20, 256, 52, 52]         294,912
      BatchNorm2d-48          [20, 256, 52, 52]             512
        LeakyReLU-49          [20, 256, 52, 52]               0
         CNNBlock-50          [20, 256, 52, 52]               0
           Conv2d-51          [20, 128, 52, 52]          32,768
      BatchNorm2d-52          [20, 128, 52, 52]             256
        LeakyReLU-53          [20, 128, 52, 52]               0
         CNNBlock-54          [20, 128, 52, 52]               0
           Conv2d-55          [20, 256, 52, 52]         294,912
      BatchNorm2d-56          [20, 256, 52, 52]             512
        LeakyReLU-57          [20, 256, 52, 52]               0
         CNNBlock-58          [20, 256, 52, 52]               0
           Conv2d-59          [20, 128, 52, 52]          32,768
      BatchNorm2d-60          [20, 128, 52, 52]             256
        LeakyReLU-61          [20, 128, 52, 52]               0
         CNNBlock-62          [20, 128, 52, 52]               0
           Conv2d-63          [20, 256, 52, 52]         294,912
      BatchNorm2d-64          [20, 256, 52, 52]             512
        LeakyReLU-65          [20, 256, 52, 52]               0
         CNNBlock-66          [20, 256, 52, 52]               0
           Conv2d-67          [20, 128, 52, 52]          32,768
      BatchNorm2d-68          [20, 128, 52, 52]             256
        LeakyReLU-69          [20, 128, 52, 52]               0
         CNNBlock-70          [20, 128, 52, 52]               0
           Conv2d-71          [20, 256, 52, 52]         294,912
      BatchNorm2d-72          [20, 256, 52, 52]             512
        LeakyReLU-73          [20, 256, 52, 52]               0
         CNNBlock-74          [20, 256, 52, 52]               0
           Conv2d-75          [20, 128, 52, 52]          32,768
      BatchNorm2d-76          [20, 128, 52, 52]             256
        LeakyReLU-77          [20, 128, 52, 52]               0
         CNNBlock-78          [20, 128, 52, 52]               0
           Conv2d-79          [20, 256, 52, 52]         294,912
      BatchNorm2d-80          [20, 256, 52, 52]             512
        LeakyReLU-81          [20, 256, 52, 52]               0
         CNNBlock-82          [20, 256, 52, 52]               0
           Conv2d-83          [20, 128, 52, 52]          32,768
      BatchNorm2d-84          [20, 128, 52, 52]             256
        LeakyReLU-85          [20, 128, 52, 52]               0
         CNNBlock-86          [20, 128, 52, 52]               0
           Conv2d-87          [20, 256, 52, 52]         294,912
      BatchNorm2d-88          [20, 256, 52, 52]             512
        LeakyReLU-89          [20, 256, 52, 52]               0
         CNNBlock-90          [20, 256, 52, 52]               0
           Conv2d-91          [20, 128, 52, 52]          32,768
      BatchNorm2d-92          [20, 128, 52, 52]             256
        LeakyReLU-93          [20, 128, 52, 52]               0
         CNNBlock-94          [20, 128, 52, 52]               0
           Conv2d-95          [20, 256, 52, 52]         294,912
      BatchNorm2d-96          [20, 256, 52, 52]             512
        LeakyReLU-97          [20, 256, 52, 52]               0
C:\Users\paulc\.conda\envs\pt3.7\lib\site-packages\torchsummary\torchsummary.py:93: RuntimeWarning: overflow encountered in long_scalars
  total_output += np.prod(summary[layer]["output_shape"])
         CNNBlock-98          [20, 256, 52, 52]               0
           Conv2d-99          [20, 128, 52, 52]          32,768
     BatchNorm2d-100          [20, 128, 52, 52]             256
       LeakyReLU-101          [20, 128, 52, 52]               0
        CNNBlock-102          [20, 128, 52, 52]               0
          Conv2d-103          [20, 256, 52, 52]         294,912
     BatchNorm2d-104          [20, 256, 52, 52]             512
       LeakyReLU-105          [20, 256, 52, 52]               0
        CNNBlock-106          [20, 256, 52, 52]               0
   ResidualBlock-107          [20, 256, 52, 52]               0
          Conv2d-108          [20, 512, 26, 26]       1,179,648
     BatchNorm2d-109          [20, 512, 26, 26]           1,024
       LeakyReLU-110          [20, 512, 26, 26]               0
        CNNBlock-111          [20, 512, 26, 26]               0
          Conv2d-112          [20, 256, 26, 26]         131,072
     BatchNorm2d-113          [20, 256, 26, 26]             512
       LeakyReLU-114          [20, 256, 26, 26]               0
        CNNBlock-115          [20, 256, 26, 26]               0
          Conv2d-116          [20, 512, 26, 26]       1,179,648
     BatchNorm2d-117          [20, 512, 26, 26]           1,024
       LeakyReLU-118          [20, 512, 26, 26]               0
        CNNBlock-119          [20, 512, 26, 26]               0
          Conv2d-120          [20, 256, 26, 26]         131,072
     BatchNorm2d-121          [20, 256, 26, 26]             512
       LeakyReLU-122          [20, 256, 26, 26]               0
        CNNBlock-123          [20, 256, 26, 26]               0
          Conv2d-124          [20, 512, 26, 26]       1,179,648
     BatchNorm2d-125          [20, 512, 26, 26]           1,024
       LeakyReLU-126          [20, 512, 26, 26]               0
        CNNBlock-127          [20, 512, 26, 26]               0
          Conv2d-128          [20, 256, 26, 26]         131,072
     BatchNorm2d-129          [20, 256, 26, 26]             512
       LeakyReLU-130          [20, 256, 26, 26]               0
        CNNBlock-131          [20, 256, 26, 26]               0
          Conv2d-132          [20, 512, 26, 26]       1,179,648
     BatchNorm2d-133          [20, 512, 26, 26]           1,024
       LeakyReLU-134          [20, 512, 26, 26]               0
        CNNBlock-135          [20, 512, 26, 26]               0
          Conv2d-136          [20, 256, 26, 26]         131,072
     BatchNorm2d-137          [20, 256, 26, 26]             512
       LeakyReLU-138          [20, 256, 26, 26]               0
        CNNBlock-139          [20, 256, 26, 26]               0
          Conv2d-140          [20, 512, 26, 26]       1,179,648
     BatchNorm2d-141          [20, 512, 26, 26]           1,024
       LeakyReLU-142          [20, 512, 26, 26]               0
        CNNBlock-143          [20, 512, 26, 26]               0
          Conv2d-144          [20, 256, 26, 26]         131,072
     BatchNorm2d-145          [20, 256, 26, 26]             512
       LeakyReLU-146          [20, 256, 26, 26]               0
        CNNBlock-147          [20, 256, 26, 26]               0
          Conv2d-148          [20, 512, 26, 26]       1,179,648
     BatchNorm2d-149          [20, 512, 26, 26]           1,024
       LeakyReLU-150          [20, 512, 26, 26]               0
        CNNBlock-151          [20, 512, 26, 26]               0
          Conv2d-152          [20, 256, 26, 26]         131,072
     BatchNorm2d-153          [20, 256, 26, 26]             512
       LeakyReLU-154          [20, 256, 26, 26]               0
        CNNBlock-155          [20, 256, 26, 26]               0
          Conv2d-156          [20, 512, 26, 26]       1,179,648
     BatchNorm2d-157          [20, 512, 26, 26]           1,024
       LeakyReLU-158          [20, 512, 26, 26]               0
        CNNBlock-159          [20, 512, 26, 26]               0
          Conv2d-160          [20, 256, 26, 26]         131,072
     BatchNorm2d-161          [20, 256, 26, 26]             512
       LeakyReLU-162          [20, 256, 26, 26]               0
        CNNBlock-163          [20, 256, 26, 26]               0
          Conv2d-164          [20, 512, 26, 26]       1,179,648
     BatchNorm2d-165          [20, 512, 26, 26]           1,024
       LeakyReLU-166          [20, 512, 26, 26]               0
        CNNBlock-167          [20, 512, 26, 26]               0
          Conv2d-168          [20, 256, 26, 26]         131,072
     BatchNorm2d-169          [20, 256, 26, 26]             512
       LeakyReLU-170          [20, 256, 26, 26]               0
        CNNBlock-171          [20, 256, 26, 26]               0
          Conv2d-172          [20, 512, 26, 26]       1,179,648
     BatchNorm2d-173          [20, 512, 26, 26]           1,024
       LeakyReLU-174          [20, 512, 26, 26]               0
        CNNBlock-175          [20, 512, 26, 26]               0
   ResidualBlock-176          [20, 512, 26, 26]               0
          Conv2d-177         [20, 1024, 13, 13]       4,718,592
     BatchNorm2d-178         [20, 1024, 13, 13]           2,048
       LeakyReLU-179         [20, 1024, 13, 13]               0
        CNNBlock-180         [20, 1024, 13, 13]               0
          Conv2d-181          [20, 512, 13, 13]         524,288
     BatchNorm2d-182          [20, 512, 13, 13]           1,024
       LeakyReLU-183          [20, 512, 13, 13]               0
        CNNBlock-184          [20, 512, 13, 13]               0
          Conv2d-185         [20, 1024, 13, 13]       4,718,592
     BatchNorm2d-186         [20, 1024, 13, 13]           2,048
       LeakyReLU-187         [20, 1024, 13, 13]               0
        CNNBlock-188         [20, 1024, 13, 13]               0
          Conv2d-189          [20, 512, 13, 13]         524,288
     BatchNorm2d-190          [20, 512, 13, 13]           1,024
       LeakyReLU-191          [20, 512, 13, 13]               0
        CNNBlock-192          [20, 512, 13, 13]               0
          Conv2d-193         [20, 1024, 13, 13]       4,718,592
     BatchNorm2d-194         [20, 1024, 13, 13]           2,048
       LeakyReLU-195         [20, 1024, 13, 13]               0
        CNNBlock-196         [20, 1024, 13, 13]               0
          Conv2d-197          [20, 512, 13, 13]         524,288
     BatchNorm2d-198          [20, 512, 13, 13]           1,024
       LeakyReLU-199          [20, 512, 13, 13]               0
        CNNBlock-200          [20, 512, 13, 13]               0
          Conv2d-201         [20, 1024, 13, 13]       4,718,592
     BatchNorm2d-202         [20, 1024, 13, 13]           2,048
       LeakyReLU-203         [20, 1024, 13, 13]               0
        CNNBlock-204         [20, 1024, 13, 13]               0
          Conv2d-205          [20, 512, 13, 13]         524,288
     BatchNorm2d-206          [20, 512, 13, 13]           1,024
       LeakyReLU-207          [20, 512, 13, 13]               0
        CNNBlock-208          [20, 512, 13, 13]               0
          Conv2d-209         [20, 1024, 13, 13]       4,718,592
     BatchNorm2d-210         [20, 1024, 13, 13]           2,048
       LeakyReLU-211         [20, 1024, 13, 13]               0
        CNNBlock-212         [20, 1024, 13, 13]               0
   ResidualBlock-213         [20, 1024, 13, 13]               0
          Conv2d-214          [20, 512, 13, 13]         524,288
     BatchNorm2d-215          [20, 512, 13, 13]           1,024
       LeakyReLU-216          [20, 512, 13, 13]               0
        CNNBlock-217          [20, 512, 13, 13]               0
          Conv2d-218         [20, 1024, 13, 13]       4,718,592
     BatchNorm2d-219         [20, 1024, 13, 13]           2,048
       LeakyReLU-220         [20, 1024, 13, 13]               0
        CNNBlock-221         [20, 1024, 13, 13]               0
          Conv2d-222          [20, 512, 13, 13]         524,288
     BatchNorm2d-223          [20, 512, 13, 13]           1,024
       LeakyReLU-224          [20, 512, 13, 13]               0
        CNNBlock-225          [20, 512, 13, 13]               0
          Conv2d-226         [20, 1024, 13, 13]       4,718,592
     BatchNorm2d-227         [20, 1024, 13, 13]           2,048
       LeakyReLU-228         [20, 1024, 13, 13]               0
        CNNBlock-229         [20, 1024, 13, 13]               0
   ResidualBlock-230         [20, 1024, 13, 13]               0
          Conv2d-231          [20, 512, 13, 13]         524,288
     BatchNorm2d-232          [20, 512, 13, 13]           1,024
       LeakyReLU-233          [20, 512, 13, 13]               0
        CNNBlock-234          [20, 512, 13, 13]               0
          Conv2d-235         [20, 1024, 13, 13]       4,718,592
     BatchNorm2d-236         [20, 1024, 13, 13]           2,048
       LeakyReLU-237         [20, 1024, 13, 13]               0
        CNNBlock-238         [20, 1024, 13, 13]               0
          Conv2d-239           [20, 24, 13, 13]          24,600
        CNNBlock-240           [20, 24, 13, 13]               0
 ScalePrediction-241         [20, 3, 13, 13, 8]               0
          Conv2d-242          [20, 256, 13, 13]         131,072
     BatchNorm2d-243          [20, 256, 13, 13]             512
       LeakyReLU-244          [20, 256, 13, 13]               0
        CNNBlock-245          [20, 256, 13, 13]               0
        Upsample-246          [20, 256, 26, 26]               0
          Conv2d-247          [20, 256, 26, 26]         196,608
     BatchNorm2d-248          [20, 256, 26, 26]             512
       LeakyReLU-249          [20, 256, 26, 26]               0
        CNNBlock-250          [20, 256, 26, 26]               0
          Conv2d-251          [20, 512, 26, 26]       1,179,648
     BatchNorm2d-252          [20, 512, 26, 26]           1,024
       LeakyReLU-253          [20, 512, 26, 26]               0
        CNNBlock-254          [20, 512, 26, 26]               0
          Conv2d-255          [20, 256, 26, 26]         131,072
     BatchNorm2d-256          [20, 256, 26, 26]             512
       LeakyReLU-257          [20, 256, 26, 26]               0
        CNNBlock-258          [20, 256, 26, 26]               0
          Conv2d-259          [20, 512, 26, 26]       1,179,648
     BatchNorm2d-260          [20, 512, 26, 26]           1,024
       LeakyReLU-261          [20, 512, 26, 26]               0
        CNNBlock-262          [20, 512, 26, 26]               0
   ResidualBlock-263          [20, 512, 26, 26]               0
          Conv2d-264          [20, 256, 26, 26]         131,072
     BatchNorm2d-265          [20, 256, 26, 26]             512
       LeakyReLU-266          [20, 256, 26, 26]               0
        CNNBlock-267          [20, 256, 26, 26]               0
          Conv2d-268          [20, 512, 26, 26]       1,179,648
     BatchNorm2d-269          [20, 512, 26, 26]           1,024
       LeakyReLU-270          [20, 512, 26, 26]               0
        CNNBlock-271          [20, 512, 26, 26]               0
          Conv2d-272           [20, 24, 26, 26]          12,312
        CNNBlock-273           [20, 24, 26, 26]               0
 ScalePrediction-274         [20, 3, 26, 26, 8]               0
          Conv2d-275          [20, 128, 26, 26]          32,768
     BatchNorm2d-276          [20, 128, 26, 26]             256
       LeakyReLU-277          [20, 128, 26, 26]               0
        CNNBlock-278          [20, 128, 26, 26]               0
        Upsample-279          [20, 128, 52, 52]               0
          Conv2d-280          [20, 128, 52, 52]          49,152
     BatchNorm2d-281          [20, 128, 52, 52]             256
       LeakyReLU-282          [20, 128, 52, 52]               0
        CNNBlock-283          [20, 128, 52, 52]               0
          Conv2d-284          [20, 256, 52, 52]         294,912
     BatchNorm2d-285          [20, 256, 52, 52]             512
       LeakyReLU-286          [20, 256, 52, 52]               0
        CNNBlock-287          [20, 256, 52, 52]               0
          Conv2d-288          [20, 128, 52, 52]          32,768
     BatchNorm2d-289          [20, 128, 52, 52]             256
       LeakyReLU-290          [20, 128, 52, 52]               0
        CNNBlock-291          [20, 128, 52, 52]               0
          Conv2d-292          [20, 256, 52, 52]         294,912
     BatchNorm2d-293          [20, 256, 52, 52]             512
       LeakyReLU-294          [20, 256, 52, 52]               0
        CNNBlock-295          [20, 256, 52, 52]               0
   ResidualBlock-296          [20, 256, 52, 52]               0
          Conv2d-297          [20, 128, 52, 52]          32,768
     BatchNorm2d-298          [20, 128, 52, 52]             256
       LeakyReLU-299          [20, 128, 52, 52]               0
        CNNBlock-300          [20, 128, 52, 52]               0
          Conv2d-301          [20, 256, 52, 52]         294,912
     BatchNorm2d-302          [20, 256, 52, 52]             512
       LeakyReLU-303          [20, 256, 52, 52]               0
        CNNBlock-304          [20, 256, 52, 52]               0
          Conv2d-305           [20, 24, 52, 52]           6,168
        CNNBlock-306           [20, 24, 52, 52]               0
 ScalePrediction-307         [20, 3, 52, 52, 8]               0
================================================================
Total params: 61,534,504
Trainable params: 61,534,504
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 39.61
Forward/backward pass size (MB): 8276.82
Params size (MB): 234.74
Estimated Total Size (MB): 8551.17
----------------------------------------------------------------

